app/views/albums/show.html.erb

SELECT `photos`.* FROM `photos` WHERE (`photos`.album_id = 1)
---
	<div class='notice_body'>
	<% @album.photos.each do |photo| %>