app/controllers/albums_controller.rb

	def show
		@album = current_user.albums.find(params[:id])
---
SELECT `albums`.* FROM `albums` WHERE `albums`.`id` = 1 AND (`albums`.user_id = 3) LIMIT 1

	def create
		current_user.albums.create(params[:album])
---
INSERT INTO `albums` (`name`, `location`, `description`, `created_at`, `updated_at`, `user_id`) VALUES ('Bachpan', 'Home', 'When i was White', '2011-06-19 10:55:06', '2011-06-19 10:55:06', 3)