app/controllers/friends_controller.rb

	def index
		@user = User.find(params[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 13 LIMIT 1

	def create
		@user = User.find(current_user)
		@friend = User.find(params[:friend_id])
		params[:friendship1] = {:user_id => @user.id, :friend_id => @friend.id, :status => 'requested'}
		params[:friendship2] = {:user_id => @friend.id, :friend_id => @user.id, :status => 'pending'}
		@friendship1 = Friendship.create(params[:friendship1])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 13 LIMIT 1
INSERT INTO "friendships" ("user_id", "friend_id", "status", "created_at", "updated_at") VALUES (4, 3, 'requested', '2011-06-20 04:13:16.613722', '2011-06-20 04:13:16.613722')

	def update
		@user = User.find(current_user)
		@friend = User.find(params[:id])
		params[:friendship1] = {:user_id => @user.id, :friend_id => @friend.id, :status => 'accepted'}
		params[:friendship2] = {:user_id => @friend.id, :friend_id => @user.id, :status => 'accepted'}
		@friendship1 = Friendship.find_by_user_id_and_friend_id(@user.id, @friend.id)
		@friendship2 = Friendship.find_by_user_id_and_friend_id(@friend.id, @user.id)
		if @friendship1.update_attributes(params[:friendship1]) && @friendship2.update_attributes(params[:friendship2])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 21 LIMIT 1
SELECT `friendships`.* FROM `friendships` WHERE `friendships`.`user_id` = 21 AND `friendships`.`friend_id` = 20 LIMIT 1
UPDATE `friendships` SET `status` = 'accepted', `updated_at` = '2011-06-12 18:45:44' WHERE `friendships`.`id` = 6

	def destroy
		@user = User.find(params[:user_id])
		@friend = User.find(params[:id])
		@friendship1 = @user.friendships.find_by_friend_id(params[:id]).destroy
		@friendship2 = @friend.friendships.find_by_user_id(params[:id]).destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 21 LIMIT 1
DELETE FROM `friendships` WHERE `friendships`.`id` = 10
SELECT `friendships`.* FROM `friendships` WHERE `friendships`.`friend_id` = 22 AND (`friendships`.user_id = 21) LIMIT 1
SELECT `friendships`.* FROM `friendships` WHERE `friendships`.`user_id` = 22 AND (`friendships`.user_id = 22) LIMIT 1