app/controllers/import_contacts_controller.rb

SELECT `users`.* FROM `users` WHERE (email = 'ryan@quantum-life.com') LIMIT 1
---
	def import
		@users = User.find(params[:id])