app/controllers/photos_controller.rb

SELECT `albums`.* FROM `albums` WHERE `albums`.`id` = 1 AND (`albums`.user_id = 3) LIMIT 1
SELECT `photos`.* FROM `photos` WHERE (`photos`.album_id = 1)
---
	def index
		render :json => current_user.albums.find(params[:album_id]).photos.to_json

SELECT `albums`.* FROM `albums` WHERE `albums`.`id` = 1 AND (`albums`.user_id = 3) LIMIT 1
SELECT `photos`.* FROM `photos` WHERE `photos`.`id` = 1 AND (`photos`.album_id = 1) LIMIT 1
---
	def show
		@photo = current_user.albums.find(params[:album_id]).photos.find(params[:id])

INSERT INTO `photos` (`caption`, `created_at`, `updated_at`, `album_id`, `picture_file_name`, `picture_content_type`, `picture_file_size`) VALUES ('biggest asshole', '2011-06-19 11:06:03', '2011-06-19 11:06:03', 1, NULL, NULL, NULL)
SELECT `albums`.* FROM `albums` WHERE `albums`.`id` = 1 AND (`albums`.user_id = 3) LIMIT 1
---
	def create
		current_user.albums.find_by_id(params[:album_id]).photos.create(params[:photo])