app/controllers/search_controller.rb

SELECT `users`.* FROM `users` WHERE (lower(first_name) LIKE '%\"abid\"%' OR lower(last_name) LIKE '%\"abid\"%' OR lower(email) LIKE '%\"abid\"%')
---
	def people
#		@users = User.search_by_term(params[:term])
		@users = User.find(:all);