app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`email`, `crypted_password`, `password_salt`, `persistence_token`, `created_at`, `updated_at`, `first_name`, `last_name`, `location`, `phone`, `profile_picture_file_name`, `profile_picture_content_type`, `profile_picture_file_size`) VALUES ('amb@amb.com', 'b938de902e7125b934340ed19237c5a372e9496e2dd1802be505c260e55b972388a9f189749be371cd2a6cd688b8c9ab25b668a95368fc77472cb4d4cee8d311', 'qgNOL8gjo4ZITqI7C5cu', '6908d16e9e8db783c4106ff4bc11d10f42633492c5cd74a82f90c66a230c9e6d6a44469a4916faed9774bb47dd3a4ad2f469155da1f74e4343616bdb5f450737', '2011-06-04 17:11:25', '2011-06-04 17:11:25', 'Aaalooo', 'Katra', NULL, NULL, NULL, NULL, NULL)

  def update
    check = params[:user]
    if current_user.update_attributes(params[:user])
---
UPDATE `users` SET `basic_current_city` = 'lahore', `basic_info_gender` = 'Male', `basic_info_show_gender_in_profile` = 1, `basic_info_birthday` = '0010-10-10', `basic_info_show_birthday_in_profile` = 1, `basic_info_interested_in` = 'Women', `basic_info_about_me` = 'I am awesome', `updated_at` = '2011-06-12 20:02:47' WHERE `users`.`id` = 13