app/controllers/wall_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
	def link
		link= Link.new(params[:link])
		activity = Activity.new(:user_id => current_user.id)
		activity.place = User.find(params[:wall_user_id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
	def photo
		activity = Activity.new( :user_id => current_user.id)
		activity.place = User.find(params[:wall_user_id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
	def video
		video = Video.new(params[:video])
		activity = Activity.new(:user_id => current_user.id)
		activity.place = User.find(params[:wall_user_id])