app/controllers/wall_controller.rb

	def comment
#		comment = Comment.new(:comment => "wajo")
		activity = Activity.find(params[:activity_id])
		activity.comments.create(:comment => "wakp")
---
SELECT `activities`.* FROM `activities` WHERE `activities`.`id` = 10 LIMIT 1
INSERT INTO `comments` (`title`, `comment`, `commentable_id`, `commentable_type`, `user_id`, `created_at`, `updated_at`) VALUES ('', 'wakp', 10, 'Activity', NULL, '2011-06-27 17:57:03', '2011-06-27 17:57:03')

	def status
		status = Status.new(params[:status])
		status.activity = Activity.new(:friend_id => current_user.id, :user_id => current_user.id)
		status.save
---
INSERT INTO `activities` (`item_id`, `item_type`, `created_at`, `updated_at`, `user_id`, `friend_id`) VALUES (6, 'Status', '2011-06-27 17:04:01', '2011-06-27 17:04:01', 3, 3)
INSERT INTO `statuses` (`text`, `created_at`, `updated_at`) VALUES ('First Status', '2011-06-19 16:26:56', '2011-06-19 16:26:56')

	def link
		link= Link.new(params[:link])
		link.activity = Activity.new(:friend_id => current_user.id, :user_id => current_user.id)
		link.save
---
INSERT INTO `activities` (`item_id`, `item_type`, `created_at`, `updated_at`, `user_id`, `friend_id`) VALUES (4, 'Link', '2011-06-27 17:05:44', '2011-06-27 17:05:44', 3, 3)
INSERT INTO `links` (`url`, `created_at`, `updated_at`) VALUES ('http://www.google.com', '2011-06-19 16:27:17', '2011-06-19 16:27:17')

	def photo
		act = Activity.new(:friend_id => current_user.id, :user_id => current_user.id)
		photo = Photo.create({:activity => act, :picture => params[:picture]})
---
INSERT INTO `activities` (`item_id`, `item_type`, `created_at`, `updated_at`, `user_id`, `friend_id`) VALUES (12, 'Photo', '2011-06-27 17:05:52', '2011-06-27 17:05:52', 3, 3)
INSERT INTO `photos` (`caption`, `created_at`, `updated_at`, `album_id`, `picture_file_name`, `picture_content_type`, `picture_file_size`) VALUES (NULL, '2011-06-27 16:47:13', '2011-06-27 16:47:13', NULL, 'monkeys2.jpg', 'image/jpeg', 80303)

	def video
		video = Video.new(params[:video])
		video.activity = Activity.new(:friend_id => current_user.id, :user_id => current_user.id)
		video.save
---
INSERT INTO `activities` (`item_id`, `item_type`, `created_at`, `updated_at`, `user_id`, `friend_id`) VALUES (1, 'Video', '2011-06-27 17:27:33', '2011-06-27 17:27:33', 3, 3)
INSERT INTO `videos` (`url`, `created_at`, `updated_at`) VALUES (NULL, '2011-06-27 17:27:33', '2011-06-27 17:27:33')